#!/usr/bin/ruby -w
# -*- coding: UTF-8 -*-

# ------------------------------------------------------------
# Ruby while 语句
$i = 0
$num = 5
 
# 语法中 do 或 : 可以省略不写。但若要在一行内写出 while 式，则必须以 do 或 : 隔开条件式或程式区块。
while $i < $num do
   puts("在循环语句中 i = #$i" )
   $i +=1
end

# ------------------------------------------------------------
# Ruby while 修饰符
begin
   puts("在循环语句中 i = #$i" )
   $i +=1
end while $i < $num

# ------------------------------------------------------------
# Ruby until 语句
# 当 conditional 为假时，执行 code。
# 语法中 do 可以省略不写。但若要在一行内写出 until 式，则必须以 do 隔开条件式或程式区块。
until $i > $num  do
   puts("在循环语句中 i = #$i" )
   $i +=1;
end

# ------------------------------------------------------------
# Ruby until 修饰符
begin
   puts("在循环语句中 i = #$i" )
   $i +=1;
end until $i > $num

# ------------------------------------------------------------
# Ruby for 语句
for i in 0..5
   puts "局部变量的值为 #{i}"
end

(0..5).each do |i|
   puts "局部变量的值为 #{i}"
end

# ------------------------------------------------------------
# Ruby redo 语句
# 重新开始最内部循环的该次迭代，不检查循环条件。如果在块内调用，则重新开始 yield 或 call。
for i in 0..5
   if i < 2 then
      puts "局部变量的值为 #{i}"
      redo
   end
end